In [1]:
import sqlalchemy
import pandas as pd
from sqlalchemy import create_engine

In [8]:
#functions:

def results(q):
    result = engine.execute(q)
    for row in result:
        print("Results:",row)

Setting up sql alchemy

In [4]:
# setting up the database:      
df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data',sep=",",header=None)
df.columns=['age','workclass','fnlwgt','education','educationNum','marital-status','occupation','relationship','race',
            'sex','capital-gain','capital-loss','hours-per-week','native-country','income']
engine = create_engine('sqlite:///sqlHW2.db')
df.to_sql('TableOne', engine)

Question 1:

In [9]:
print(results("select * from TableOne Limit 5;"))

Results: (0, 39, ' State-gov', 77516, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', ' Male', 2174, 0, 40, ' United-States', ' <=50K')
Results: (1, 50, ' Self-emp-not-inc', 83311, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 13, ' United-States', ' <=50K')
Results: (2, 38, ' Private', 215646, ' HS-grad', 9, ' Divorced', ' Handlers-cleaners', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K')
Results: (3, 53, ' Private', 234721, ' 11th', 7, ' Married-civ-spouse', ' Handlers-cleaners', ' Husband', ' Black', ' Male', 0, 0, 40, ' United-States', ' <=50K')
Results: (4, 28, ' Private', 338409, ' Bachelors', 13, ' Married-civ-spouse', ' Prof-specialty', ' Wife', ' Black', ' Female', 0, 0, 40, ' Cuba', ' <=50K')
None

Question 2: Write two basic update queries

In [11]:
print("Before Updating the data for gender and education:")
results("select * from TableOne where fnlwgt=77516;")

Before Updating the data for gender and education:
Results: (0, 39, ' State-gov', 77516, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', ' Male', 2174, 0, 40, ' United-States', ' <=50K')

In [13]:
print("Updating the data for gender Male to Female and educationNum 13 to 25: ")
engine.execute("UPDATE TableOne SET sex = 'Female' where fnlwgt=77516;")
engine.execute("UPDATE TableOne SET educationNum = 25 where fnlwgt=77516")
results("select * from TableOne where fnlwgt=77516;")

Updating the data for gender Male to Female and educationNum 13 to 25:
Results: (0, 39, ' State-gov', 77516, ' Bachelors', 25, ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', 'Female', 2174, 0, 40, ' United-States', ' <=50K')

Question 3:

In [14]:
print("Before deleting any data: ")
results("select * from TableOne where fnlwgt in(77516,285294);")

Before deleting any data:
Results: (0, 39, ' State-gov', 77516, ' Bachelors', 25, ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', 'Female', 2174, 0, 40, ' United-States', ' <=50K')
Results: (27532, 28, ' Private', 285294, ' Bachelors', 13, ' Married-civ-spouse', ' Sales', ' Wife', ' Black', ' Female', 15024, 0, 45, ' United-States', ' >50K')

In [16]:
print("After deleting data: ")
engine.execute("delete from TableOne where fnlwgt in(77516);")
engine.execute("delete from TableOne where age=28 and education=' Bachelors' and sex=' Female' and race=' Black' and relationship=' Wife' and occupation=' Sales';")

After deleting data:

In [19]:
a=results("select * from TableOne where fnlwgt in(77516,285294);")

In [20]:
print(a)

None

Question 4:

In [21]:
results("select * from TableOne where fnlwgt in(99928,124191) and sex=' Male';")

Results: (100, 76, ' Private', 124191, ' Masters', 14, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 40, ' United-States', ' >50K')

In [22]:
results("select * from TableOne where sex=' Female' and fnlwgt LIKE '%89392%';")

Results: (1341, 57, ' Private', 89392, ' Masters', 14, ' Married-spouse-absent', ' Prof-specialty', ' Not-in-family', ' White', ' Female', 0, 0, 40, ' United-States', ' <=50K')

Question 5:

In [23]:
results("select sum(age) from TableOne;")

Results: (1256190,)

In [24]:
results("select avg(age) from TableOne where sex=' Male';")

Results: (39.433567396392675,)